## Linkedin.com

In [1]:
import pandas as pd
from cleaner import *

df_linkedin = cleaner("..\offres_linkedin.csv") 
df_linkedin.head()

,Titre,Entreprise,Localisation,Lien,Compétences,mapped_role
0,Junior Data Engineer - Casablanca,Artefact,Casablanca,https://ma.linkedin.com/jobs/view/junior-data-...,"agile, airflow, aws, azure, beam, bigquery, ci...",data engineer
1,Data Engineer (H/F),Smile,Casablanca,https://ma.linkedin.com/jobs/view/data-enginee...,"airflow, python, snowflake, sql",data engineer
2,Data Engineer,Artefact,Casablanca,https://ma.linkedin.com/jobs/view/data-enginee...,"agile, airflow, aws, azure, beam, bigquery, ci...",data engineer
3,DATA ENGINEER (H/F),Groupe INTM,Casablanca,https://ma.linkedin.com/jobs/view/data-enginee...,"docker, gcp, kafka, kubernetes, looker, python...",data engineer
4,Data engineer,SII Group Morocco,Casablanca,https://ma.linkedin.com/jobs/view/data-enginee...,"airflow, power bi, spark",data engineer

In [2]:
df_linkedin.shape

(421, 6)

In [3]:
df_linkedin.nunique()

Titre           307
Entreprise      138
Localisation     12
Lien            421
Compétences     239
mapped_role       6
dtype: int64

In [4]:
df_linkedin.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421 entries, 0 to 420
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Titre         421 non-null    string
 1   Entreprise    421 non-null    string
 2   Localisation  421 non-null    string
 3   Lien          421 non-null    string
 4   Compétences   363 non-null    string
 5   mapped_role   421 non-null    object
dtypes: object(1), string(5)
memory usage: 19.9+ KB

In [5]:
df_linkedin['mapped_role'].value_counts()

mapped_role
autre                175
web developer         67
data analyst          59
data engineer         54
software engineer     37
data scientist        29
Name: count, dtype: int64

## rekrute.com

In [6]:
import pandas as pd
from cleaner import *

df_rekrute = cleaner("..\offres_rekrute.csv") 
df_rekrute.head()

,Titre,Entreprise,Localisation,Lien,Compétences,mapped_role
0,dataanalystCDD,AXA Services Maroc,Rabat,https://www.rekrute.com/offre-emploi-data-anal...,"python, r, sql",data analyst
1,Stagiaire Businessanalyst(H/F),Groupe Label'Vie - Carrefour,Casablanca,https://www.rekrute.com/offre-emploi-stagiaire...,excel,data analyst
2,Businessanalystdata– Spécialisation Finance,Inetum,Casablanca,https://www.rekrute.com/offre-emploi-business-...,"azure, power bi",data analyst
3,Businessanalyst,Groupe Label'Vie - Carrefour,Casablanca,https://www.rekrute.com/offre-emploi-business-...,<NA>,data analyst
4,Stagiairedataanalyst/ Engineer,Orange Business,Rabat,https://www.rekrute.com/offre-emploi-stagiaire...,"deep learning, docker, excel, git, hadoop, ker...",data analyst

In [7]:
df_rekrute.shape

(71, 6)

In [8]:
df_rekrute.nunique()

Titre           63
Entreprise      20
Localisation     6
Lien            51
Compétences     30
mapped_role      5
dtype: int64

In [9]:
df_rekrute['mapped_role'].value_counts()

mapped_role
autre                33
data scientist       12
data analyst         11
software engineer    10
data engineer         5
Name: count, dtype: int64

In [10]:
df_rekrute.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71 entries, 0 to 70
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Titre         71 non-null     string
 1   Entreprise    71 non-null     string
 2   Localisation  71 non-null     string
 3   Lien          71 non-null     string
 4   Compétences   52 non-null     string
 5   mapped_role   71 non-null     object
dtypes: object(1), string(5)
memory usage: 3.5+ KB

### concaténer

In [11]:
df = pd.concat([df_rekrute, df_linkedin], axis=0)

In [12]:
df.shape

(492, 6)

In [13]:
df['mapped_role'].value_counts()

mapped_role
autre                208
data analyst          70
web developer         67
data engineer         59
software engineer     47
data scientist        41
Name: count, dtype: int64

In [14]:
df.drop(df[df["mapped_role"]=="autre"].index, axis=0, inplace=True)

In [15]:
df.shape

(252, 6)

In [16]:
df.duplicated().sum()

2

In [17]:
df.drop_duplicates(inplace=True)

In [18]:
df.drop_duplicates(subset=["Titre", "Entreprise", "Localisation"], inplace=True)

In [19]:
df.shape

(205, 6)

In [22]:
df.to_csv("../data/dataset_final.csv")